Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: The "serpent128-ctr" method uses the Serpent block cipher [SERPENT] with 128-bit keys.
ja: "serpent128-ctr" は 128-bit 鍵を用いる Serpent ブロック暗号 [SERPENT] を使う,

source: In both cases, the validity of the authentication depends upon the strength of the linkage between the public signing key and the identity of the signer.
ja: どちらの場合も, 認証の有効性は, 公開署名鍵と署名者のIDとの関連の強さに依存する.

source: In the case of key exchange, this protection is not needed because the key exchange methods described here already perform an equivalent operation; namely, they generate a MIC of the SSH exchange hash, which is a hash of several items including the lists of key exchange mechanisms supported by both sides.
ja: 鍵交換の場合, この保護は必要ない. ここで記述した鍵交換法は同等の操作を実行するからだ. すなわち, それぞれの側でサポートされる鍵交換メカニズムのリストを含むいくつかの要素のハッシュである SSH の交換ハッシュから MICを生成する.

source: The 'service name' for this protocol is "ssh-userauth".
ja: このプロトコルの 'service name' は, "ssh-userauth" だ.

source: In any case, if the user does not exist, the authentication request MUST NOT be accepted.
ja: どちらの場合でもユーザが存在しなければ， 認証の共有を受け入れてはならない．

source: Public Key Algorithm Name Reference ------------------------- --------- ssh-dss [SSH-TRANS, Section 6.6] ssh-rsa [SSH-TRANS, Section 6.6] pgp-sign-rsa [SSH-TRANS, Section 6.6] pgp-sign-dss [SSH-TRANS, Section 6.6]
ja: 公開鍵アルゴリズム名 Reference ------------------------- --------- ssh-dss [SSH-TRANS, Section 6.6] ssh-rsa [SSH-TRANS, Section 6.6] pgp-sign-rsa [SSH-TRANS, Section 6.6] pgp-sign-dss [SSH-TRANS, Section 6.6]

source: Public Key Subsystem Attribute Names .
ja: 公開鍵サブシステムの属性名 .

source: This additional protection is available when the negotiated GSS-API context supports per-message integrity protection, as indicated by the setting of the integ_avail flag on successful return from GSS_Init_sec_context() or GSS_Accept_sec_context().
ja: 交渉済みの GSS-API コンテキストが メッセージ単位の完全性保護とサポートしている場合, つまり GSS_Init_sec_context() かGSS_Accept_sec_context() の呼び出しが成功し integ_avail フラグが設定されている場合, この追加の保護が有効になる.

source: The choice of hash function from the SHA2 hash function family is based on the key size of the ECDSA key as specified in Section 6.2.1 of [RFC5656].
ja: SHA2 ハッシュ関数ファミリからのハッシュ関数の選択は, [RFC5656] の 6.2.1 節で指定されているように ECDSA 鍵の鍵サイズの基づく.

source: Use in Public Key Algorithms
ja: 公開鍵アルゴリズムでの利用

source: Key File Format
ja: 鍵ファイルの形式

source: Ignored Data Message
ja: 無視データメッセージ

source: If there are no unsent packets, then a packet containing SSH_MSG_IGNORE SHOULD be sent.
ja: 未送信パケットがない場合, SSH_MSG_IGNOREを含むパケットが送られる必要がある.

source: Any implementation supporting at least one key exchange method that conforms to Section 2 MUST also support the "null" host key algorithm.
ja: 2 節に従う 鍵交換メソッドを1つでもサポートする実装は, "null" ホスト鍵アルゴリズムもサポートしなければならない.

source: Note that the 'packet_length' field is also encrypted, and processing it requires special care when sending or receiving packets.
ja: 'packet_length' フィールドも暗号化されるので, パケットを送受信する際の packet_lengthの扱いには特別な注意が必要なことに注意.

source: The client and server user names are inherently constrained by what the server is prepared to accept.
ja: クライアントとサーバのユーザ名は, 本質的にサーバが受け入れられるものに制限される.

source: On the other hand, it is perfectly safe to have the following situation:
ja: 一方, 次の場合は完全に安全だ.

source: Secure Shell Public Key Subsystem
ja: セキュアシェル公開鍵サブシステム

source: The "cast128-ctr" method uses the CAST-128 cipher with 128-bit keys [RFC2144].
ja: "cast128-ctr" は 128-bit 鍵を用いる CAST-128 暗号を使う [RFC2144].

source: Such fingerprints can easily be verified by using telephone or other external communication channels.
ja: このような指紋は, 電話や他の外部の通信チャンネルで容易に検証できる.

source: It may be removed in a future revision of this specification.
ja: この仕様の将来のバージョンでは, 削除されるだろう.

source: The Authentication Method Name is used to describe an authentication method for the "ssh-userauth" service [SSH-USERAUTH].
ja: 認証法の名前は, "ssh-userauth" サービス [SSH-USERAUTH] の認証法を記述するのに使われる.

source: Central registration of all extensions is cumbersome, especially for experimental or classified features.
ja: すべての拡張を中央で登録することは面倒だ. 特に, 実験的な特徴や機密扱いのものにとってはそうだ.

source: Channel Connection Failure 'reason code' values MUST be assigned sequentially.
ja: チャンネル接続失敗の 'reason code' の値は, 連続して割り当てられなければならない.

source: Conventions .........................................5 4.1.2.
ja: 規約............................................5 4.1.2.

source: If 'want reply' is FALSE, no response will be sent to the request.
ja: 'want reply' が FALSE なら, 要求に対する返答は送られない.

source: The hashing and message authentication code algorithms are defined by the method name to allow room for other algorithms to be defined for use with ECMQV in future documents.
ja: ハッシュとメッセージ認証コードのアルゴリズムは, 方法の名前で定義される. その他のアルゴリズムをECMQVで許可する余地があるかどうかは, 将来の文書で定義される.

source: The key blobs in this protocol MAY contain certificates in addition to keys.
ja: このプロトコルの key blob は 鍵に加えて証明書も含んでもよい.

source: padding_length Length of 'random padding' (bytes).
ja: padding_length 'random padding' の長さ (byte単位).

source: This gives the server complete control over the authentication process if desired, but also gives enough flexibility for the client to use the methods it supports or that are most convenient for the user, when multiple methods are offered by the server.
ja: これは, サーバが, もし望むならば, 認証のプロセスを完全に制御できることを意味する. 一方で, サーバから複数の方法が提供された場合に, クライアントがサポートしていたりユーザにもっとも便利な認証法を利用可能な自由度も提供する.

source: In fact, due to its smaller key sizes, elliptic curve cryptography can be implemented more efficiently for the same security level than RSA, finite field Diffie-Hellman, or DSA.
ja: 実際, 楕円曲線暗号は, RSAや有限体 Diffie-Hellman, DSA より小さな鍵サイズを持つので, 同じセキュリティレベルをより効率的に実装することができる.

source: Normative References ............................................7 7.
ja: 標準のリファレンス ............................................7 7.

source: When a client sends this message, it MUST be followed by a new authentication request or by terminating the connection.
ja: クライアントがこのメッセージを送る場合は, 次に新しい認証の要求か接続の切断をしなければならない.

source: New Client, Old Server .....................................6 5.3.
ja: 新しいクライアントで古いサーバ.........................6 5.3.

source: The password-authentication mechanism allows for integration with deployed password-based infrastructure.
ja: パスワード認証メカニズムは, 配置されたパスワードベースの基盤と統合できる.

source: This is purely coincidental and actually has nothing to do with STD 11 [9].
ja: これは, 単なる偶然でありSTD 11 [9]とは関係ない.

source: The SSH user authentication method name "gssapi-keyex", to name the GSS-API user authentication method defined in Section 4.
ja: SSH ホスト公開鍵アルゴリズム名 "gssapi-keyex" で, 4 節で定義した GSS-API ユーザ認証法を指定する.

source: Error Token ...............................................18 4.
ja: エラートークン ...............................................18 4.

source: In [BKN1,BKN2], Bellare, Kohno, and Namprempre show how to modify the symmetric portion of the SSH Transport Protocol so that it provably preserves privacy and integrity against chosen-plaintext, chosen- ciphertext, and reaction attacks.
ja: [BKN1,BKN2]で, Bellare と Kohno, Namprempre は, 選択平文, 選択暗号文, 反応攻撃(reaction attack) に対して秘匿と完全性を保持するために, SSH トランスポートプロトコルの対称部分をどう変更すればいいか示している.

source: After a key exchange with implicit server authentication, the client MUST wait for a response to its service request message before sending any further data.
ja: 暗黙のサーバ認証での鍵交換の後で, クライアントは, 他のデータを送る前にサービスの要求メッセージに対する返答を待たなければならない.

source: Authentication Method Names
ja: 認証法の名前

source: AEAD_AES_256_GCM is specified in Section 5.2 of [RFC5116].
ja: AEAD_AES_256_GCM は, [RFC5116] の5.2節で指定されている.

source: Note that some userauth methods may defend against this situation, but many of the common ones (including password and keyboard-interactive) do not and, in fact, depend on the fact that the server's identity has been verified (so passwords are not disclosed to an attacker).
ja: いくつかのユーザ認証法はこの状況と防御するが, (パスワード認証やキーボードインタラクティブ認証を含む)一般的な認証法の多くは防御しない. 実際, これらはサーバの識別情報が検証される(つまり, パスワードは攻撃者に漏れない)ことに依存している.

source: At the 128-bit minimum level of security:
ja: 128ビットのセキュリティ最小レベルの場合:

source: Recall from [RFC4253] that the encryption methods in each direction of an SSH connection MUST run independently of each other and that, when encryption is in effect, the packet length, padding length, payload, and padding fields of each packet MUST be encrypted with the chosen method.
ja: [RFC4253] を思い出してください: SSH接続のそれぞれの方向の暗号法はそれぞれ独立に働く. また, 暗号化が行なわれている場合, パケットの packet length, padding length, payload, padding のフィールドは, 取り決められた暗号アリゴリズムによって暗号化されなければならない.

source: The number of client-server exchanges required to complete an authentication using this method may be variable.
ja: この方法で認証を完了するために必要なクライアント-サーバの交換の数は変化するかもしれない.

source: The "none" Authentication Request ..........................7 5.3.
ja: "none" 認証要求 ..........................7 5.3.

source: Server interpretation of the submethods field is implementation- dependent.
ja: submethods のサーバの解釈は, 実装依存だ.

source: The resulting signature is encoded as follows:
ja: 署名の結果次のようにエンコードされる:

source: This may be done either by including SIZE constraints on the index components or by specifying applicable constraints in the conceptual row DESCRIPTION clause or in the surrounding documentation.
ja: インデックスコンポーネントに SIZE 制限を含めるか, DESCRIPTION 項目か周辺の文書に適用可能な制約を指定するかで, これを行なうことができる.

source: Compression Algorithm Name Reference -------------------------- --------- none [SSH-TRANS, Section 6.2] zlib [SSH-TRANS, Section 6.2]
ja: 圧縮アルゴリズム名 Reference -------------------------- --------- none [SSH-TRANS, Section 6.2] zlib [SSH-TRANS, Section 6.2]

source: The SSH Transport Model should support any server- or client- authentication mechanism supported by SSH.
ja: SSH トランスポートモデルは SSH でサポートされる 任意のサーバ/クライアント 認証メカニズムをサポートする必要がある.

source: After the key exchange, the client requests a service.
ja: 鍵交換の後で, クライアントはサービスを要求する.

source: The SSH Transport Model will likely not work in conditions where remote access to the CLI has stopped working.
ja: SSH トランスポートモデルは, CLI へのリモートアクセスの動作が停止された状態では動作しないだろう.

source: This section is designed to help implementors understand the security-related motivations for, as well as possible consequences of deviating from, the methods and recommendations described in this document.
ja: この節は, この文書で記述された方法と推薦に対するセキュリティに関する動機と方法や推薦を採用しない場合に起こりえる結果についての実装者の理解を支援する

source: Encryption, compression, and MAC methods are not changed before a new SSH_MSG_NEWKEYS is sent after the key exchange (as in the initial key exchange).
ja: 暗号化, 圧縮, MAC は, (最初の鍵交換と同様に) 鍵交換の後で 新しい SSH_MSG_NEWKEYS が送られるまでは変更されない.

source: This document provides new public key algorithms and new key agreement methods for the Secure Shell protocol.
ja: この文書はセキュアシェルプロトコルに新しい公開鍵アルゴリズムと新しい同意方法を提供する.

source: The client SHOULD ignore pty requests.
ja: クライアントは, pty 要求を無視する必要がある.

source: This MIB module also references [RFC1033], [RFC4252], [RFC3490], and [RFC3986].
ja: この MIB モジュールは, [RFC1033], [RFC4252], [RFC3490], [RFC3986] も参照する.

source: Suite B provides for two levels of cryptographic security, namely a 128-bit minimum level of security (minLOS_128) and a 192-bit minimum level of security (minLOS_192).
ja: Suite B は 2つのレベルの暗号学的セキュリティを提供する. すなわち, 128-bit セキュリティ最小レベル (minLOS_128) と 192-bit セキュリティ最小レベル (minLOS_192) だ.

source: Failure of end-point security will compromise all data passed over proxy forwarding.
ja: エンドポイントのセキュリティに問題があると, プロキシ転送上で通信されるすべてのデータが侵害される.

source: Block Counter: A 32-bit integer, set to one at the start of each new SSH binary packet and incremented as each 16-octet block of data is processed.
ja: ブロックカウンタ: 32-ビット整数. 新しい SSH バイナリパケットの開始字に 1 に設定され, データの16-オクテットのブロックが処理されるごとに増加.

source: It is RECOMMENDED that X11 display implementations default to allow the display to open only over local IPC.
ja: X11のディスプレイの実装が, デフォルトではlocalのIPC上でのみディスプレイをオープンすることが推奨される.

source: It may involve several packet exchanges, as specified by the key exchange method.
ja: 鍵交換法の指定によっては, 複数のパケットの交換が行なわれる.

source: The DNS-ID MAY contain the wildcard character '*' as the complete left-most label within the identifier.
ja: DNS-ID は, 識別子内の 完全最左ラベルとして ワイルドカード文字 '＊" を含んでもよい.

source: Like all key-exchange mechanisms, this one depends for its security on the randomness of the secrets generated by the client (the random number K) and the server (the transient RSA private key).
ja: すべての鍵交換メカニズムと同様, この方法も, クライアントとサーバが生成する秘密のランダム性(乱数K と 一時RSA秘密鍵) にそのセキュリティを依存している.

source: However, even when a subsystem is used, some extraneous messages may
ja: しかし, サブシステムを用いても, いくつかの余計なメッセージがユーザの起動スクリプトによって表示される可能性はある.

source: Using NETCONF over SSH .
ja: SSH 上での NETCONF の利用 .

source: Impact on Network Operation
ja: ネットワーク操作への影響

source: Whilst some server implementations may send the responses in some order, client implementations should not rely on responses being in any order.
ja: 実装はそれぞれ特定のオーダーで応答を返すだろうが, クライアントの実装は特定のオーダーの応答に依存しないほうがよい.

source: The "blowfish-ctr" method uses Blowfish with 256-bit keys [SCHNEIER].
ja: "blowfish-ctr" は 256-bitの鍵を用いる Blowfish を使う [SCHNEIER].

source: AES GCM Algorithms for Secure Shell .............................6 6.1.
ja: セキュアシェルのための AES GCM アルゴリズム .............................6 6.1.

source: There MUST be at least four bytes of padding.
ja: 少なくとも 4 byte のパディングをしなければならない.

source: This latter property is true regardless of what encryption mode is used.
ja: 後者の性質は, 利用暗号モードに関係なく存在する.

source: In particular, it is possible for users to overwrite an existing key on the server with this protocol, whilst at the same time specifying fewer restrictions for the new key than were previously present.
ja: 特に, このプロトコルを用いて, 以前の制限よりも小さい制限を指定してサーバ上の既存の鍵をユーザが上書きできる.

source: A common application of the Telnet protocol is the "Console Server" [7] whereby a Telnet Network Virtual Terminal (NVT) can be connected to a physical RS-232/V.24 asynchronous port, making the Telnet NVT appear as a locally attached terminal to that port, and making that physical port appear as a network-addressable device.
ja: Telnet プロトコルの共通のアプリケーションに "Console Server" [7] がある. これにより, Telnet Network Virtual Terminal (NVT) は, 物理 RS-232/V.24 非同期ポートに接続されると, この Telnet NVT は そのポートにローカルに接続されたように見え, その物理ポートは ネットワークのアドレスを持つデバイスのようにみえる.

source: addresses this dilemma by requiring that, in AES-GCM, the packet length field will not be encrypted but will instead be processed as additional authenticated data.
ja: この文書は, AES-GCM で packet length フィールドを暗号化せず変わりに追加の認証データとして処理することで要求することで, このジレンマを解決する.

source: Forward Secrecy
ja: 前方秘密性

source: Proxy Forwarding
ja: ポート転送

source: The terminal emulation may also allow configuring the default character set.
ja: 端末エミュレーションは, デフォルトの文字セットを設定することを許可するかもしれない.

source: Status of This Memo
ja: このメモの位置づけ

source: Transport layer protocol:
ja: トランスポート層プロトコル:

source: 2) The packet cannot be parsed until the packet_length has been decrypted.
ja: 2) packet_length が復号されるまでパケットがパースできない.

source: The selection of the signature algorithm to be used for server authentication is governed by the server_host_key_algorithms name- list in the SSH_MSG_KEXINIT packet (see Section 3.1).
ja: サーバ認証で用いられる署名アルゴリズムの選択は, SSH_MSG_KEXINIT パケット内の server_host_key_algorithms name-list で管理される (3.1 節を参照).

source: Password Authentication Method: "password" .....................10 9.
ja: パスワード認証法: "password" .....................10 9.

source: Authentication Examples
ja: 認証の例

source: The intent is that the names for any such future methods be defined in a similar manner to that used in Section 2.3.
ja: すべての将来の方法の名前が， 2．3節で用いられたものと同じように定義されることを意図している．

source: For the purposes of a critical attribute, mere storage of the attribute is not sufficient -- rather, the server must understand and implement the intent of the attribute.
ja: critical な属性の目的を充たすためには, 単なる属性の保存では十分ではない. サーバは属性の意図を理解し実装していなけばならない.

source: 35 IGNCR Ignore CR on input.
ja: 35 IGNCR 入力でCRを無視する. (

source: Revealing information about the reason for an authentication failure may be considered by some sites to be an unacceptable security risk for a production environment.
ja: 認証失敗の理由の情報を開示することは, 本番環境では受け入れられないセキュリティリスクと考えるサイトもある.

source: Otherwise, it SHOULD NOT be displayed unless debugging information has been explicitly requested by the user.
ja: しかし, ユーザが明示的にデバッグ情報の表示を求めていない場合には表示しないほうがよい.

source: Here, the 'p', 'q', 'g', and 'y' parameters form the signature key blob.
ja: ここで, パラメータ 'p', 'q', 'g', 'y'は署名のkey blob を生成する.

source: 1 VINTR Interrupt character; 255 if none.
ja: 1 VINTR 割り込み文字. もしなければ255.

source: Completion ................................................17 3.8.
ja: 完了 ................................................17 3.8.

source: Replay .............................................16 9.3.4.
ja: リプレイ(再送) ...................................16 9.3.4.

source: The terms "manager" and "agent" are not used in this document because, in the RFC 3411 architecture, all SNMP entities have the capability of acting as manager, agent, or both depending on the SNMP application types supported in the implementation.
ja: "manager" と "agent" という用語はこの文書では用いない. RFC3411 アーキテクチャで, すべての SNMP エンティティは, 実装でサポートされるSNMPアプリケーションの種類依存して マネージャやエージェント, その両方の機能を持つ, となっているからだ.

source: 61 ECHOKE Visual erase for line kill.
ja: 61 ECHOKE 行の削除を視覚的に行なう.

source: The KeyUsage and ExtendedKeyUsage extensions may be used to restrict the use of X.509v3 certificates in the context of the Secure Shell protocol as specified in the following sections.
ja: KeyUsage と ExtendedKeyUsage 拡張は, 以下の節で指定されるように, セキュアシェルの文脈で X.509v3 証明書の利用を制限するのに利用されることがある.

source: It then calls GSS_VerifyMIC() to verify that the MIC sent by S matches H. If the MIC is not successfully verified, the key exchange MUST fail.
ja: そして GSS_VerifyMIC() を呼び出し, Sから送られたMICが H と一致するか検証する. MIC の検証に失敗したら鍵交換は失敗しなければならない.

source: However, a better approach, for reasons discussed above, might be to reply with an SSH_MSG_USERAUTH_INFO_REQUEST message and ignore (don't validate) the response.
ja: しかし, 上で議論した理由により, よりよいアプローチは, SSH_MSG_USERAUTH_INFO_REQUEST メッセージで応答して その返答を無視 (検証しない)することだろう..

source: Authentication is no stronger than the weakest combination allowed.
ja: 認証の強さは, 最も弱い許可された方法(ないしその組合せ)の強さとなる.

source: Clients SHOULD use control character filtering, as discussed in [SSH-ARCH], to avoid attacks by including terminal control characters in the fields to be displayed.
ja: [SSH-ARCH} で議論されているように, 表示されるフィールドに端末制御文字が含まれる攻撃を防ぐために, クライアントは制御文字のフィルタリングをする必要がある.

source: The use of the "none" authentication method is NOT RECOMMENDED, as described in this document's Security Considerations.
ja: この文書のセキュリティの考察で記述するように, "none" 認証法の利用は推奨されない.

source: A NETCONF server will process NETCONF messages from the NETCONF client in the order in which they are received.
ja: NETCONF サーバは, NETCONF クライアントからのメッセージを受け取った順に処理する.

source: Here, we'll call it HASH.
ja: ここで, これを HASH とする.

source: Different authentication methods reuse the same message numbers.
ja: 異なる認証法は, 同じメッセージ番号を再利用する.

source: The security considerations in [RFC4251] also apply to this key exchange method.
ja: [RFC4251]のセキュリティの考察はこの鍵公開法にも適用される.

source: In the following description (C is the client, S is the server, the modulus p is a large safe prime, and g is a generator for a subgroup of GF(p), min is the minimal size of p in bits that is acceptable to the client, n is the size of the modulus p in bits that the client would like to receive from the server, max is the maximal size of p in bits that the client can accept, V_S is S's version string, V_C is C's version string, K_S is S's public host key, I_C is C's KEXINIT message, and I_S is S's KEXINIT message that has been exchanged before this part begins):
ja: 以下の記述では, C はクライアント, S はサーバ, 法 p は大きく安全な素数, g は GF([)の部分群の生成器, min は クライアントが受容できる p のbitでの最小サイズ, n はクライアントがサーバから受け取りたい pのbitでの最小サイズ, max はクライアントが受容できるpのbitでの最大サイズ. V_S はＳのバージョン文字列, V_C は Cのバージョン文字列, K_S はホスト公開鍵, I_C は CのKEXINITメッセージ, Ｉ_S は SのKEXINITメッセージ (VS以降はこの部分が始まる前に交換されたもの)とする:

source: For this call, the client MUST set mutual_req_flag to "true" to request that mutual authentication be performed.
ja: この呼び出しでは, クライアントは相互認証の実行を要求するために mutual_req_flag を "true" に設定しなければならない.

source: It is RECOMMENDED that clients request and check the reply for this request.
ja: クライアントがこの要求で応答を要求し検査するのを推奨する.

source: Names .
ja: 名前 .

source: Public key algorithm names for use in 'public key algorithm for host key' are defined in the transport layer specification [SSH-TRANS].
ja: 'public key algorithm for host key'で用いられる公開鍵アルゴリズム名は, トランスポート層の仕様 [SSH-TRANS] で定義されている.

source: snmpSshtmSessionNoChannels OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION "The number of times an openSession() request failed to open a session as an SSH client due to channel-open failures.
ja: snmpSshtmSessionNoChannels OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION "チャンネル開始失敗のため SSH クライアントとしてセッションの開始に失敗した openSession() 要求の回数.

source: An error indication in statusInformation will typically include the Object Identifier (OID) and value for an incremented error counter.
ja: statusInfomation のエラー表示は, 典型的に オブジェクト識別子 (OID) と 増加されるエラーカウンタのための値を典型的に含む.

source: If an error occurs during this exchange on server side, the server can terminate the method by sending an SSH_MSG_USERAUTH_FAILURE packet.
ja: この交換の間にサーバ側でエラーが起きたら， SSH_MSG_USERAUTH_FAILURE パケットをサーバは送って認証法を終了してよい．

source: The transport protocol [SSH-TRANS] recommends rekeying after one gigabyte of data, and the smallest possible packet is 16 bytes.
ja: トランスポートプロトコル [SSH-TRANS] は, 1GBのデータごとに鍵の再作成を推奨している. また, 可能な最小のパケットを16byteにすることを推奨している.

source: Protocol packets containing the SSH_MSG_CHANNEL_EXTENDED_DATA message MUST have Extended Channel Data Transfer 'data_type_code' values in the range of 0x00000001 to 0xFFFFFFFF.
ja: SSH_MSG_CHANNEL_EXTENDED_DATA メッセージを含むプロトコルのパケットは, 0x00000001 から 0xFFFFFFFF の範囲の拡張チャンネルデータ転送の 'data_type_code' を持たなければならない.

source: Banner Message .............................................7 6.
ja: バナー メッセージ.......................................7 6.

source: It wraps around to zero after every 2^32 packets.
ja: これは, 2^32 パケットの後で 0 に戻る.

source: In particular, the encoding used by the system for user names is a matter for the ssh server implementation.
ja: 特に， ユーザ名のためにシステムが用いるエンコーディングは， SSHのサーバの実装の問題だ．

source: Registrations
ja: 登録

source: This mapping will allow NETCONF to be executed from a secure shell session by a user or application.
ja: このマッピングで, ユーザやアプリケーションによるSSHセッションから NETCONF を実行できるようになる.

source: Encryption Method Considerations ...........................8 Normative References ...............................................9 Informative References ............................................10
ja: 暗号モードの考察 ...........................8 Normative References ...............................................9 Informative References ............................................10

source: However, if the password has expired, the server SHOULD indicate this by responding with SSH_MSG_USERAUTH_PASSWD_CHANGEREQ.
ja: しかし, パスワードの有効期限が切れている場合, サーバは, SSH_MSG_USERAUTH_PASSWD_CHANGEREQ を応答して期限切れを示す必要がある.

source: Naming Conventions
ja: 命名規則

source: Whatever attributes the user subsequently asked the server to apply to their key, the server would also apply the "shell" attribute, rendering it impossible for the user to use a shell.
ja: ユーザがその後鍵をサーバに適用する際に要求する属性がどのようなものでも, ユーザのシェルの利用を禁止するため "shell" 属性もサーバは適用する

source: This method works by having the client send a signature created with the private key of the client host, which the server checks with that host's public key.
ja: この認証法は, クライアントがクライアントホストの秘密鍵で作られた署名を送りサーバがクライアントホストの公開鍵でチェックすることで動作する.

source: These methods are described in Section 8.
ja: これらの方法は, 8 節に記述されている.

source: o There is no blank line before the start of the base64-encoded contents.
ja: o base64 エンコードされた内容の開始の前に空白行はない.

source: o C is the client, and S is the server
ja: o C はクライアントでSはサーバだ
